7767517
4 4
Input                    in0                      0 1 in0
Gemm                     gemm_0                   1 1 in0 1 10=4 2=0 3=1 4=0 5=1 6=1 7=63 8=896 9=896
GELU                     gelu_2                   1 1 1 2
Gemm                     gemm_1                   1 1 2 out0 10=4 2=0 3=1 4=0 5=1 6=1 7=63 8=1024 9=896
